const products = [
  {
    id: 1,
    name: "Pro Carbon-GR",
    title: "प्रो कार्बन-GR (आर्गेनिक कार्बन और आर्गेनिक NPK) ",
    image: "./public/Pro_carbon_gr.jpg",
    description:
      "<li>यह शुद्ध ऑर्गेनिक कार्बन है, इसमें मुख्य एवं सुक्ष्म पोषक तत्व भी है। </li>\
<li>प्रो कार्बन GR में 25% आर्गेनिक कार्बन, 6% आर्गेनिक नाइट्रोजन, 1% आर्गेनिक फॉस्फोरस, 1% आर्गेनिक पोटास एवं 1% अन्य ट्रेस एलिमेंट होता है। </li>\
<li> यह सभी फसलों में बैसल खाद के साथ उपयोग किया जाता है। </li>\
<li> प्रो कार्बन फसलों में पोषक तत्वों की पूर्ति करता है। </li>\
<li> यह मिट्टी में ऑर्गेनिक कार्बन की मात्रा को बढ़ाता है, जिससे भूमि की उर्वरकता बढ़ती है। </li>\
<li> किसी भी फसल में कोई भी अवस्था हो प्रो कार्बन बहुत उपयोगी है, यह पौधे की जड़ विकास को बढ़ाता है। </li> \
<br>\
अधिक से अधिक सफेद रेशेदार जड़े निकालता है, जिससे पौधे की जल एवं पोषक तत्व अवशोषण क्षमता बढ़ती है। केला, पपीता, अनार एवं अन्य बागवानी फसलो में 5 कि. ग्रा. प्रो कार्बन GR प्रति 1000 पौधों में बैसल खाद के साथ उपयोग करें। \
अन्य फसलों में 5 कि. ग्रा. प्रो कार्बन GR प्रति एकड़ बैसल खाद के साथ उपयोग करें।  \
<br> \
<br> \
(यदि खेत में गोबर खाद नहीं डालते है, तो भूमि की उर्वरा शक्ति बनाये रखने एवं अच्छे उत्पादन के लिए पूरे वर्ष में 5-10 कि. ग्रा. प्रो कार्बन GR प्रति एकड़ फसल अनुसार अवश्य प्रयोग करें, यह जमीन में गोबर खाद की पूर्ति करेगा।)",
  },

  {
    id: 2,
    name: "Pro Carbon",
    title: "प्रो कार्बन (आर्गेनिक कार्बन और आर्गेनिक NPK)",
    image: "./public/Pro_carbon.jpg",
    description:
      " यह शुद्ध ऑर्गेनिक कार्बन है इसमें मुख्य एवं सूक्ष्म पोषक तत्व भी है। प्रो कार्बन में 25% आर्गेनिक कार्बन, 6% ऑर्गेनिक नाइट्रोजन, 1% ऑर्गेनिक फॉस्फोरस, 1% ऑर्गेनिक पोटास एवं 1% अन्य ट्रेस एलिमेंट होते हैं। यह सभी फसलों में ड्रेचिंग, या ड्रिप सिंचाई के द्वारा उपयोग किया जाता है। प्रो कार्बन फसलों में पोषक तत्वों की पूर्ति करता है। यह मिट्टी में ऑर्गेनिक कार्बन की मात्रा को बढ़ाता है, जिससे भूमि की उर्वरकता बढ़ती है। किसी भी फसल में कोई भी अवस्था हो प्रो कार्बन बहुत उपयोगी है, यह पौधे की जड़ विकास को बढ़ाता है। अधिक से अधिक सफेद रेशेदार जड़े निकालता है, जिससे पौधे की जल एवं पोषक तत्व अवशोषण क्षमता बढ़ती है। \
केला, पपीता, अनार एवं अन्य बागवानी फसलो में 1.5 लीटर प्रो कार्बन प्रति 1000 पौधों में ड्रिप या ड्रेचिंग में उपयोग करें। \
अन्य फसलों में 1 लीटर प्रो कार्बन प्रति एकड़ ड्रेचिंग या ड्रिप से उपयोग करें। \
<br>\
<br> \
(यदि खेत में गोबर खाद नहीं डालते है, तो भूमि की उर्वरा शक्ति बनाये रखने एवं अच्छे उत्पादन के लिए पूरे वर्ष में 3-5 लीटर प्रो कार्बन प्रति एकड़ फसल अनुसार अवश्य प्रयोग करें, यह जमीन में गोबर खाद की पूर्ति करेगा।)",
  },
  {
    id: 3,
    name: "Amino",
    title: "अमिनो (अमिनो एसिड) ",
    image: "./public/Amino.jpg",
    description: "अमिमो अमिनो एसिड का एक अनूठा मिश्रण है, जिसमें पौधे से प्राप्त फ्री अमिनो एसिड 65 प्रतिशत है। यह सभी फसलों में उपयोग किया जाता है। इसका प्रयोग फसलों पर छिड़काव द्वारा और रूट ड्रेचिंग, ड्रिप सिंचाई दोनों ही तरीके से किया जा सकता है। \
<li> फसल बढ़वार में मदद करता है। </li>\
<li> फसलों को तनाव मुक्त करें। </li>\
<li> फसलों से पीलापन हटाये। </li>\
<li> फूल और फल सेटिंग में मदद। </li>\
<li> यह  पोषक तत्वों से भरपूर अमिनो एसिड है। </li> \
<br> \
अमिनो की विभिन्न फसलों में सिफारिश मात्रा सभी फसलों में अमिमो की 500 मि. ली. मात्रा को 180-200 लीटर पानी में मिलाकर एक समान रूप से छिड़काव करें। केला, पपीता एवं अन्य बागवानी फसलों में प्रति 1000 पौधों पर 500 मि.ली. ड्रिप से या ड्रेचिंग करें। अन्य फसलों में 500 मि. ली. प्रति एकड़ ड्रिप या ड्रेचिंग करें।",
  },

  {
    id: 4,
    name: "Hummerr",
    title: "हमर (बायो पेस्टीसाईड) ",
    image: "./public/Hummerr.jpg",
    description:
      "<li>यह एक ऑर्गेनिक कीटनाशक है। </li>\
<li> इसका प्रयोग विभिन्न फसलों में आने वाली मकड़ी और थ्रिप्स के नियंत्रण के लिए होता है। </li>\
<li> यह फसल में नए फुटाव और वृद्धि में मदद करता है। </li>\
<li> फसल की कीटों से लड़ने की क्षमता बढ़ाता है। </li>\
<br> \
सभी फसलों में थ्रिप्स और मकड़ी के नियंत्रण के लिए हमर की 250 मि. ली. मात्रा को 180-200 लीटर पानी में मिलाकर फसल पर एक सामान रूप से छिड़काव करें। </li>",
  },

  {
    id: 5,
    name: "Silistick",
    title: "सिलिस्टिक (विटामीन-C युक्त सिलिकॉन) ",
    image: "./public/Silistick.jpg",
    description: "<li>यह विटामीन-C युक्त उच्च गुणवत्ता वाला सिलिकॉन स्प्रेडर है। </li>\
<li> यह किसी भी प्रकार के इंसक्टिसाइड, फंगीसाइड, वीडीसाइड या उर्वरकों के साथ उपयोग किया जा सकता है। </li>\
<li> यह इंसेक्टिसाइड, फंगीसाइड, वीडीसाइड या उर्वरकों को फसल की पत्तियों पर अच्छी तरह से फैलाता है साथ ही पत्तियों से अवशोषण में भी मदद करता है।</li> \
<li> जिन फसलों में पोलीनेशन की आवश्यकता होती है, उन फसलों में पोलीनेशन को बढ़ाने के लिए मधुमक्खी को भी आकर्षित करने में मदद करता है। </li>\
<br> \
सभी फसलों में सिलिस्टक 60 मि. ली. मात्रा को 180-200 लीटर पानी में मिलाकर एक समान रूप से छिड़काव करें।",
  },
  {
    id: 6,
    name: "ProGro 20",
    title: "प्रोग्रो 20 (अमिनो एसिड + सिवीड एक्सट्रेक्ट + फुल्वीक एसिड) ",
    image: "./public/ProGro20.jpg",
    description: "* यह एक बायोस्टिमुलेंट है, जो फसलों में जैविक और अजैविक त नाव को कम करता है। </li>\
<li> यह जैव प्रो‌द्योगिकी अनुसंधान में एक नवाचार का प्रतिनिधित्व करता है। </li> \
<li> जिसमें समुद्री शैवाल के अर्क और पौधों के अर्क से प्राप्त अमीनों एसिड के मिश्रण से निर्मित एक अनूठा फार्मूला शामिल है। </li>\
<li> यह फसलों में हर महत्वपूर्ण अवस्था और विभिन्न परिस्थितियों में अत्यधिक प्रभावी साबित होता है। </li>\
<li> यह पौधों में प्रतिरोधक क्षमता को बढ़ाता है और पौधे की सर्वांगीण वृद्धि करता है। * पत्तियों का आकार एवं हरापन बढ़ाता है। </li>\
<br> \
सभी फसलों में प्रोग्रो 20 की 500 मि.ली. मात्रा को 180-200 लीटर पानी में मिलाकर एक समान रूप से छिड़काव करें। केला, पपीता एवं अन्य बागवानी फसलों में प्रति 1000 पौधों पर 500 मि.ली. ड्रिप से या ड्रेचिंग करें। \
अन्य फसलों में 500 मि.ली. प्रति एकड़ ड्रिप या ड्रेचिंग करें।",
  },
  {
    id: 7,
    name: "Set Up",
    title: "सेट अप (प्लांट प्रोटिन्स + विटामिन्स) ",
    image: "./public/SetUp.jpg",
    description: "<li>सेट अप पौधों से निकाले गए विटामिन और प्रोटीन का एक विशेष मिश्रण है, जो फसल में फुलों की संख्या बढ़ाता है, इन्हें झड़ने से रोकता है। \
<li> इसमें ऐसे एंजाइम होते हैं जो नर और मादा फलों के अनुपात बने बनाए रखते है। </li>\
<li> सेट अप अधिक से अधिक फूलों को फलों में रूपांतरित कर, उत्पादन में वृद्धि करता है। </li>\
<li> यह फूल और फल की गुणवत्ता सुधार करता है। </li>\
<li> बेहतर परिणाम के लिए पहला स्प्रे प्रारंभिक फूल वाली अवस्था पर और दूसरा स्प्रे फल विकास की अवस्था पर करें। </li>\
<br> \
सभी फसलों में सेट अप की 100 मि. ली. को 180-200 लीटर पानी में मिलाकर एक समान रूप से छिड़काव करें।",
  },
  {
    id: 8,
    name: "Ami Nutri",
    title: "एमिन्यूट्री (अमिनो एसिड + माईक्रोन्युट्रीएन्ट) ",
    image: "./public/Ami_Nutri.jpg",
    description: "<li> एमिन्यूट्री मुक्त अमीनो एसिड और सूक्ष्म पोषक तत्वों का मिश्रण है। </li>\
<li> इसमें मौजूद अमीनो एसिड पौधे की वृद्धि को बढ़ाने में मदद करतें है। </li>\
<li> इसमें सूक्ष्म पोषक तत्व होते है, जो पौधों में सूक्ष्म पोषक तत्वों की कमी को पूरा करते है और उत्पादन क्षमता को बढ़ाते है। </li>\
<li> इससे पौधों में क्लोरोफिल में वृद्धि होती है, जिससे प्रकाश संश्लेषण दर में वृद्धि होती है। </li>\
<br> \
सभी फसलों में एमिन्यूट्री की 250 मि.ली. मात्रा को 180-200 लीटर पानी में मिलाकर एक समान रूप से छिड़काव करें। केला, पपीता एवं अन्य बागवानी फसलों में प्रति 1000 पौधों पर 250 मि.ली. ड्रिप से या ड्रेचिंग करें। \
अन्य फसलों में 250 मि.ली. प्रति एकड़ ड्रिप या ड्रेचिंग करें।",
  },
  {
    id: 9,
    name: "Pro 98-H",
    title: "प्रो 98 एच (ह्युमिक एसिड + पोटेशियम ऑक्साईड) ",
    image: "./public/Pro_98H.jpg",
    description: "<li> प्रो 98 एच मिट्टी की जल धारण क्षमता को बढ़ाता है। </li>\
<li> यह मिट्टी की भौतिक रासायनिक और जैविक गुणवत्ता में सुधार करता है। </li>\
<li> ये सफेद जड़ों के विकास में मदद करते हैं। </li>\
<li> मिट्टी में हवा और पानी का सही संतुलन बनाए रखता है। </li>\
<li> पोषक तत्वों के लिए चेलेटिंग एजेंट के रूप में काम करता है, जिससे उत्पादन की गुणवत्ता बढ़ती है। </li>\
<li> यह पौधे की वृद्धि और शाखाओं के विकास का कार्य भी करता है। </li>\
<br>\
सभी फसलों में प्रो 98 एच की 500 ग्राम मात्रा को 180-200 लीटर पानी में मिलाकर एक समान रूप से छिड़काव करें। केला, पपीता एवं अन्य बागवानी फसलों में प्रति 1000 पौधों पर 500 ग्राम ड्रिप से या ड्रेचिंग करें। \
अन्य फसलों में 500 ग्राम प्रति एकड़ ड्रिप या ड्रेचिंग करें।",
  },
  {
    id: 10,
    name: "ReActive",
    title: "रिएक्टिव (बायो फंगीसाईड) ",
    image: "./public/ReActive.jpg",
    description: "<li> रिएक्टिव जैविक कवकनाशी एक विशेष रूप से तैयार किया गया कवकनाशी है, जो किसी भी मौसम या तापमान में सक्रिय रहता है। </li>\
<li> रिएक्टिव का उपयोग विभिन्न फसलों में पाउडरी मिल्ड्यू, डाउनी मिल्डयू एवं सभी प्रकार के प्रति के धब्बा रोग का नियंत्रण करने के लिए किया जाता है। </li>\
<li> यह जड़ सड़न-गलन और बिल्ट का नियंत्रित करने में प्रभावी है। </li>\
<li> यह बीमारियों के साथ पौधे की रोगों के प्रति सहनशीलता प्रदान करता है। </li>\
<br> \
सभी फसलों में रिएक्टिव की 1 किलो मात्रा को 180-200 लीटर पानी में मिलाकर एक \
समान रूप से छिड़काव करें। केला, पपीता एवं अन्य बागवानी फसलों में प्रति 1000 पौधों पर 1 किलो ड्रिप या ड्रेचिंग करें। अन्य फसलों में 1 कि. ग्रा. प्रति एकड़ ड्रिप या ड्रेचिंग करें।",
  },
];

const productContainer = document.getElementById("product-list");

const productHTML = products
  .map(
    (product,index) => `
    <div class="m-2 w-full bg-white shadow-md rounded-lg p-4 border-black border-2 flex justify-around gap-5 items-center ${index % 2 === 0 ? '' : 'flex-row-reverse'}">
    <div class="text-white text-center flex flex-col items-center w-[25vw] h-[500px] ">
    <img src="${product.image}" alt="${product.name}" 
      class="w-[150px] h-[200px] object-cover mx-auto mb-4 rounded-lg border-2 border-red-500" >
        
        <h2 class="text-2xl font-bold font-[Hind]">${product.name}</h2>
    </div>
    <div class="flex-1">
        <p class="text-red-600 font-bold text-2xl">${product.title}</p>
        <div class="mt-2 border-2 border-blue-500 text-black px-4 py-2 rounded-md">
            ${product.description}
        </div>
    </div>
</div>

`
  )
  .join("");

productContainer.innerHTML = productHTML;

